In [2]:
import pandas as pd

Importing CSV data

In [3]:
df = pd.read_csv('/Users/sauami/Documents/Python/survey_results_public.csv')

df_survey = pd.read_csv('/Users/sauami/Documents/Python/survey_results_schema.csv')
#df = pd.read_csv('survey_results_schema.csv')

In [4]:
pd.set_option('display.max_rows', 20)
df.head(5)

,ResponseId,MainBranch,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,LearnCodeCoursesCert,YearsCode,...,TimeSearching,TimeAnswering,Onboarding,ProfessionalTech,TrueFalse_1,TrueFalse_2,TrueFalse_3,SurveyLength,SurveyEase,ConvertedCompYearly
0,1,None of these,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,I am a developer by profession,"Employed, full-time",Fully remote,Hobby;Contribute to open-source projects,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Difficult,NaN
2,3,"I am not primarily a developer, but I write co...","Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)",Books / Physical media;Friend or family member...,Technical documentation;Blogs;Programming Game...,NaN,14,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Neither easy nor difficult,40205.0
3,4,I am a developer by profession,"Employed, full-time",Fully remote,I don’t code outside of work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Books / Physical media;School (i.e., Universit...",NaN,NaN,20,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,215232.0
4,5,I am a developer by profession,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Other online resources (e.g., videos, blogs, f...",Technical documentation;Blogs;Stack Overflow;O...,NaN,8,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Easy,NaN

In [5]:
#to treat custome null values like na missing no data as null
naval=['na','NA','Missing','no data','any custom value']
mydf = pd.read_csv('survey_results_public.csv', index_col = 'ResponseId', na_values=naval)
mydf

FileNotFoundError: [Errno 2] No such file or directory: 'survey_results_public.csv'

In [ ]:
mydf[['Country','RemoteWork']].value_counts()

In [ ]:
# find dataframe column unique values
mydf['RemoteWork'].unique()

In [ ]:
#this is specific to pandas no reference to dataframe
pd.set_option('display.max_column',50)

In [ ]:
#df.info() - list of column with name and datatype
df.head() #list sample record from df
df.shape # give number of rows and column in DF

In [140]:
#describe the dataframe with basic mean medium std and %tile values for numerical fields
df_people.describe()

               id     index
count    10.00000  10.00000
mean   1005.50000   4.50000
std       3.02765   3.02765
min    1001.00000   0.00000
25%    1003.25000   2.25000
50%    1005.50000   4.50000
75%    1007.75000   6.75000
max    1010.00000   9.00000

In [ ]:
df_survey.head(2)
df.head(2)

df_survey[['qname','type']]
df_survey.head(5)
#df_survey.set_index('qid', inplace=True)
#df_survey.reset_index(inplace=True)

In [ ]:
#Conditional record search by using AND & /OR | operator
df_survey.loc[(df_survey['qname']=='S0') & (df_survey['qid']=='QID16')]

# Dataframe info df information

In [12]:
#number of row and column along with column info
# df.info()
#df.head(5)
#df.columns
#df.index
df.tail(5)

,ResponseId,MainBranch,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,LearnCodeCoursesCert,YearsCode,...,TimeSearching,TimeAnswering,Onboarding,ProfessionalTech,TrueFalse_1,TrueFalse_2,TrueFalse_3,SurveyLength,SurveyEase,ConvertedCompYearly
73263,73264,I am a developer by profession,"Employed, full-time",Fully remote,Freelance/contract work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Other online resources ...,Technical documentation;Blogs;Written Tutorial...,Udemy,8,...,30-60 minutes a day,Less than 15 minutes a day,Just right,DevOps function;Microservices;Developer portal...,Yes,Yes,Yes,Too long,Easy,NaN
73264,73265,I am a developer by profession,"Employed, full-time",Full in-person,Hobby,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)","Other online resources (e.g., videos, blogs, f...",Technical documentation;Blogs;Written Tutorial...,Coursera;Udemy;Udacity,6,...,15-30 minutes a day,60-120 minutes a day,Very long,None of these,No,Yes,Yes,Too long,Easy,NaN
73265,73266,"I am not primarily a developer, but I write co...","Employed, full-time","Hybrid (some remote, some in-person)",Hobby;School or academic work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Other online resources ...,Technical documentation;Programming Games;Stac...,Udemy;Codecademy;Pluralsight;edX,42,...,30-60 minutes a day,60-120 minutes a day,Just right,None of these,No,No,No,Appropriate in length,Easy,NaN
73266,73267,I am a developer by profession,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;On the job training,NaN,NaN,50,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,NaN
73267,73268,"I used to be a developer by profession, but no...","Independent contractor, freelancer, or self-em...",Fully remote,Hobby;Contribute to open-source projects;Boots...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Friend or family member...,Technical documentation;Blogs;Programming Game...,Udemy;Pluralsight,16,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,NaN

In [13]:
#this set the number of columns or rows of the dataframe to be display
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_columns', 6)
pd.set_option('display.max_rows',6)
df[-3:]

,ResponseId,MainBranch,Employment,...,SurveyLength,SurveyEase,ConvertedCompYearly
73265,73266,"I am not primarily a developer, but I write co...","Employed, full-time",...,Appropriate in length,Easy,NaN
73266,73267,I am a developer by profession,"Employed, full-time",...,Appropriate in length,Easy,NaN
73267,73268,"I used to be a developer by profession, but no...","Independent contractor, freelancer, or self-em...",...,Appropriate in length,Easy,NaN

In [170]:
#Python dictionary to prepare manual dataset to create Pandas DataFrame
people = {
    'id': [1001,1003,1002,1004,1005,1006,1007,1008,1009,1010],
    'fname': ['Jack','Tom','Traci','Rosy','Jack','Jhon','Jenny','Tom','Raj','Terry'],
    'lname': ['Foly','Alter','Saw','Burk','jack@email','Dow','Dow','Hanks','Saurabh','Dow'], 
    'email': ['jack.foly@email','tom.alter@email','traci.saw@email','rosy.burk@email','jack@email','jhon.dow@email.com','jenny.dow@email.com','tom.hanks@email.com','saurabh.raj@email.com','td@email.com'],
    'country':['USA','UK','India','Canada','Germany','USA','USA','UK','India', 'USA'],
    'work mode': ['remote','work from home','office','head office','remote','office','Remote','office','work from home','Office'],
    'dept': ['IT','Sales','Marketing','Admin','Sales','Developer','Admin','Sales','VP','Finance'],
    'emp_type':['emp','cwx','emp','cwx','emp','emp','cwx','emp','emp','emp'],
    'language': ['English;French','Spanish;French;English','Dutch;English',
                 'Finish;English;Python','English;Hindi;Java:Spanish','English:SQL:Python',
                 'English;Unix','Hindi;Python-English','Dutch;Swiss;English','English'
                ]
}

In [15]:
#Way to access python dictionary
people['email'][1:3]

['tom.alter@email', 'traci.saw@email']

In [23]:
pd.set_option('display.max_rows', 30)
pd.set_option('display.max_columns',20)

In [171]:
#Pandas dataframe is similar but proivde more functionality over data and can visulize more redable form

import pandas as pd
df_people = pd.DataFrame(people)

#access dataframe multiple column values
#df_people[['fname','lname']]
# df_people
df_people[-2:]

,id,fname,lname,email,country,work mode,dept,emp_type,language
8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English
9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English

In [ ]:
pd.set_option('display.max_columns',10)
#accessing row using integer location iloc method, additionally you can locate range of records by using the : colon
#or use the list squar bracket to pass the record index to diaplay, remember end range number is excluded
df_people.iloc[1:4]

In [47]:
df_people[1:4]

,id,fname,lname,email,country,work mode,dept,emp_type,language
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python

In [ ]:
df_people.iloc[[1,2,3,4]]

In [50]:
#listout the dataframe columns
df_people.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         10 non-null     int64
 1   fname      10 non-null     object
 2   lname      10 non-null     object
 3   email      10 non-null     object
 4   country    10 non-null     object
 5   work mode  10 non-null     object
 6   dept       10 non-null     object
 7   emp_type   10 non-null     object
 8   language   10 non-null     object
dtypes: int64(1), object(8)
memory usage: 848.0+ bytes

In [51]:
#Info about DataFrame row index, starting row index and Df last record df 
df_people.index

RangeIndex(start=0, stop=10, step=1)

# Note: You can also access the df by dot notation, but be caucious when df column and method name are same in this case python will call method rather then column

if you have column name EMP as well as method EMP in this case python will use method or give error better use the brackets for best practice

In [54]:
df_people.fname

0     Jack
1      Tom
2    Traci
3     Rosy
4     Jack
5     Jhon
6    Jenny
7      Tom
8      Raj
9    Terry
Name: fname, dtype: object

In [55]:
#multiple column is not series type its again a df
#series is one diamentional array for one column and values
type(df_people[['fname','lname']])

pandas.core.frame.DataFrame

In [56]:
#access data frame column's
pd.set_option('display.max_rows',20)
df_people[['fname','email','work mode','id']]

   fname                  email       work mode    id
0   Jack        jack.foly@email          remote  1001
1    Tom        tom.alter@email  work from home  1003
2  Traci        traci.saw@email          office  1002
3   Rosy        rosy.burk@email     head office  1004
4   Jack             jack@email          remote  1005
5   Jhon     jhon.dow@email.com          office  1006
6  Jenny    jenny.dow@email.com          Remote  1007
7    Tom    tom.hanks@email.com          office  1008
8    Raj  saurabh.raj@email.com  work from home  1009
9  Terry           td@email.com          Office  1010

In [ ]:
#filtering specific record from dataframe without loc or iloc
df_people[(df_people['work mode']=='remote') & (df_people['email']=='jack@email')] # [['fname','lname']] give 2 field only

df_people[(df_people['work mode']=='remote') & (df_people['email']=='jack@email')]

In [ ]:
df_people.rename(columns= {'work mode': 'work_mode'}, inplace=True)
type(df_people['fname'])

# value.counts() method can also be use as group by clause to group the data based on number of columns

In [75]:
#count the values get percentage %age instead of count use normalize=True for decimal %age additionally you can add *100
#df_people.rename(columns={'work mode':'work_mode'}, inplace=True)
df_people[['country','work mode']].value_counts(normalize=True)
df_people[['dept','work mode']].value_counts()

dept       work mode
Admin      Remote            1
           head office       1
Developer  office            1
Finance    Office            1
IT         remote            1
Marketing  office            1
Sales      office            1
           remote            1
           work from home    1
VP         work from home    1
dtype: int64

# rename DataFrame column name df.rename(columns = {old:new,}, inplace=True)

In [76]:
df_people.rename(columns = {'work mode':'work_mode'}, inplace=True)

In [94]:
# df_people.set_index('email', inplace=True)
df_people.iloc[0:2]
df_people.loc['jack.foly@email']

In [100]:
df_people.reset_index(inplace=True)

In [96]:
#loc[row/[rows]], column/[columns] for range no need to use the list bracket
df_people.loc[[1,2], ['email','fname']]

             email  fname
1  tom.alter@email    Tom
2  traci.saw@email  Traci

In [97]:
df_people.set_index('id', inplace=True)

In [98]:
#though index is changed to id but iloc still using the numerical index values
df_people.iloc[[1,2,0],[1,4,5]]

                email country       work_mode
id
1003  tom.alter@email      UK  work from home
1002  traci.saw@email   India          office
1001  jack.foly@email     USA          remote

In [109]:
df_people[df_people['language'].str.contains('Spanish')]
df_people['language']

0                English;French
1        Spanish;French;English
2                 Dutch;English
3         Finish;English;Python
4    English;Hindi;Java:Spanish
5            English:SQL:Python
6                  English;Unix
7          Hindi;Python-English
8           Dutch;Swiss;English
9                       English
Name: language, dtype: object

loc and iloc
#iloc and loc both reference to dataframe rows by index, iloc access integer index where loc access rows by label

# Query Dataframe Rows use the loc and iloc (iloc is integer location of row) and loc row label both point to row only
eg. if you have reset your default index(0-~)you can not give reference to filter row on index 0 or 1 because this index is no longer available, but you can still refer the loc which is label like record 1 or 10th record etc
iloc: search by row index
loc: search by label

In [101]:
#df.loc
df.iloc[[0,2]]
#if we want email column for selected two row in this case use the column index outside list

df.iloc[[0,2],1:3]
# df.loc[1:4,['RemoteWork','Employment']]
df.loc[df['MainBranch']=='None of these',['ResponseId']]

       ResponseId
0               1
30             31
86             87
146           147
190           191
...           ...
73109       73110
73157       73158
73201       73202
73215       73216
73243       73244

[1497 rows x 1 columns]

In [ ]:
df_people

In [110]:
# apply is used to apply the method on the dataframe or run the lambda etc, see the eg custom function
#Note apply works on series means single column if you want to apply the function on all columns use applymap
df_people['fname'].apply(len)
df_people['fname']=df_people['fname'].apply(lambda x: x.upper())
df_people

,id,index,email,fname,lname,country,work_mode,dept,emp_type,language
0,1001,0,jack.foly@email,JACK,Foly,USA,remote,IT,emp,English;French
1,1003,1,tom.alter@email,TOM,Alter,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,2,traci.saw@email,TRACI,Saw,India,office,Marketing,emp,Dutch;English
3,1004,3,rosy.burk@email,ROSY,Burk,Canada,head office,Admin,cwx,Finish;English;Python
4,1005,4,jack@email,JACK,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish
5,1006,5,jhon.dow@email.com,JHON,Dow,USA,office,Developer,emp,English:SQL:Python
6,1007,6,jenny.dow@email.com,JENNY,Dow,USA,Remote,Admin,cwx,English;Unix
7,1008,7,tom.hanks@email.com,TOM,Hanks,UK,office,Sales,emp,Hindi;Python-English
8,1009,8,saurabh.raj@email.com,RAJ,Saurabh,India,work from home,VP,emp,Dutch;Swiss;English
9,1010,9,td@email.com,TERRY,Dow,USA,Office,Finance,emp,English

In [111]:
df_people[['fname','fname','email']].applymap(lambda x: x.upper())

   fname  fname                  email
0   JACK   JACK        JACK.FOLY@EMAIL
1    TOM    TOM        TOM.ALTER@EMAIL
2  TRACI  TRACI        TRACI.SAW@EMAIL
3   ROSY   ROSY        ROSY.BURK@EMAIL
4   JACK   JACK             JACK@EMAIL
5   JHON   JHON     JHON.DOW@EMAIL.COM
6  JENNY  JENNY    JENNY.DOW@EMAIL.COM
7    TOM    TOM    TOM.HANKS@EMAIL.COM
8    RAJ    RAJ  SAURABH.RAJ@EMAIL.COM
9  TERRY  TERRY           TD@EMAIL.COM

In [114]:
# df_people['profession']=df_people.loc[df_people['dept']=='IT', 'dept']+'-'+'Industry'
df_people
# df_people.drop(columns='profession', inplace=True)
# df_people.fillna('No Industry Defined', inplace=True)

,id,index,email,fname,lname,country,work_mode,dept,emp_type,language
0,1001,0,jack.foly@email,JACK,Foly,USA,remote,IT,emp,English;French
1,1003,1,tom.alter@email,TOM,Alter,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,2,traci.saw@email,TRACI,Saw,India,office,Marketing,emp,Dutch;English
3,1004,3,rosy.burk@email,ROSY,Burk,Canada,head office,Admin,cwx,Finish;English;Python
4,1005,4,jack@email,JACK,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish
5,1006,5,jhon.dow@email.com,JHON,Dow,USA,office,Developer,emp,English:SQL:Python
6,1007,6,jenny.dow@email.com,JENNY,Dow,USA,Remote,Admin,cwx,English;Unix
7,1008,7,tom.hanks@email.com,TOM,Hanks,UK,office,Sales,emp,Hindi;Python-English
8,1009,8,saurabh.raj@email.com,RAJ,Saurabh,India,work from home,VP,emp,Dutch;Swiss;English
9,1010,9,td@email.com,TERRY,Dow,USA,Office,Finance,emp,English

In [128]:
df_people['country_dept'] = df_people['country'] + '-' + df_people['dept']

In [133]:
df_people[df_people['country']=='USA']

,id,index,email,fname,lname,country,work_mode,dept,emp_type,language,country_dept
0,1001,0,jack.foly@email,JACK,Foly,USA,remote,IT,emp,English;French,USA-IT
5,1006,5,jhon.dow@email.com,JHON,Dow,USA,office,Developer,emp,English:SQL:Python,USA-Developer
6,1007,6,jenny.dow@email.com,JENNY,Dow,USA,Remote,Admin,cwx,English;Unix,USA-Admin
9,1010,9,td@email.com,TERRY,Dow,USA,Office,Finance,emp,English,USA-Finance

In [129]:
# df_people['new_dept'] = df_people.loc[df_people['dept']=='IT', 'dept'] + '-'+df_people.loc[df_people['dept']=='IT', 'emp_type'] 
df_people
# df_people.drop(columns='new_dept', inplace=True)

,id,index,email,fname,lname,country,work_mode,dept,emp_type,language,country_dept
0,1001,0,jack.foly@email,JACK,Foly,USA,remote,IT,emp,English;French,USA-IT
1,1003,1,tom.alter@email,TOM,Alter,UK,work from home,Sales,cwx,Spanish;French;English,UK-Sales
2,1002,2,traci.saw@email,TRACI,Saw,India,office,Marketing,emp,Dutch;English,India-Marketing
3,1004,3,rosy.burk@email,ROSY,Burk,Canada,head office,Admin,cwx,Finish;English;Python,Canada-Admin
4,1005,4,jack@email,JACK,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish,Germany-Sales
5,1006,5,jhon.dow@email.com,JHON,Dow,USA,office,Developer,emp,English:SQL:Python,USA-Developer
6,1007,6,jenny.dow@email.com,JENNY,Dow,USA,Remote,Admin,cwx,English;Unix,USA-Admin
7,1008,7,tom.hanks@email.com,TOM,Hanks,UK,office,Sales,emp,Hindi;Python-English,UK-Sales
8,1009,8,saurabh.raj@email.com,RAJ,Saurabh,India,work from home,VP,emp,Dutch;Swiss;English,India-VP
9,1010,9,td@email.com,TERRY,Dow,USA,Office,Finance,emp,English,USA-Finance

In [134]:
# df_people[df_people['fname']=='JACK']
df_people.loc[df_people['language'].str.contains('Spanish') & df_people['language'].str.contains('English'),['dept','fname']]
# df_people[['random_column1', 'random_col2']] = df_people[df_people['language'].str.contains('Spanish') & df_people['language'].str.contains('English')][['dept','fname']]
# df_people

    dept fname
1  Sales   TOM
4  Sales  JACK

In [ ]:
df_people[['new_dept','new_profession']] = df_people.loc[df_people['language'].str.contains('Spanish') & df_people['language'].str.contains('English')][['dept','profession']]

In [ ]:
df_people['df_direct_col'] = df_people['language'].str.contains('Spanish') & df_people['language'].str.contains('English')

In [136]:
df_people['country_emp_type'] = df_people['country'] + '-' + df_people['emp_type']

In [138]:
df_people.drop(columns='country_emp_type')
# use Curley bracket for more than one column to drop

,id,index,email,fname,lname,country,work_mode,dept,emp_type,language,country_dept
0,1001,0,jack.foly@email,JACK,Foly,USA,remote,IT,emp,English;French,USA-IT
1,1003,1,tom.alter@email,TOM,Alter,UK,work from home,Sales,cwx,Spanish;French;English,UK-Sales
2,1002,2,traci.saw@email,TRACI,Saw,India,office,Marketing,emp,Dutch;English,India-Marketing
3,1004,3,rosy.burk@email,ROSY,Burk,Canada,head office,Admin,cwx,Finish;English;Python,Canada-Admin
4,1005,4,jack@email,JACK,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish,Germany-Sales
5,1006,5,jhon.dow@email.com,JHON,Dow,USA,office,Developer,emp,English:SQL:Python,USA-Developer
6,1007,6,jenny.dow@email.com,JENNY,Dow,USA,Remote,Admin,cwx,English;Unix,USA-Admin
7,1008,7,tom.hanks@email.com,TOM,Hanks,UK,office,Sales,emp,Hindi;Python-English,UK-Sales
8,1009,8,saurabh.raj@email.com,RAJ,Saurabh,India,work from home,VP,emp,Dutch;Swiss;English,India-VP
9,1010,9,td@email.com,TERRY,Dow,USA,Office,Finance,emp,English,USA-Finance

In [ ]:
df_people.drop(columns={'random_column1', 'random_col2'})

In [167]:
# add salary column

In [172]:
df_people

,id,fname,lname,email,country,work mode,dept,emp_type,language
0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python
4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish
5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python
6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix
7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English
8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English
9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English

In [176]:
# df_people.drop(index=10 )
# df_people.dropna(axis='index', how='all')
# df_people.reset_index(inplace=True)
df_people = df_people.append(df_people.loc[3], ignore_index=True)
df_people

/var/folders/l5/0hgvlxrn1q9cm7g8sk6xxnr00000gn/T/ipykernel_1314/801798633.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_people = df_people.append(df_people.loc[3], ignore_index=True)

,id,fname,lname,email,country,work mode,dept,emp_type,language
0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python
4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish
5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python
6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix
7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English
8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English
9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English
10,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python

In [177]:
df_people.loc[10, 'country'] = 'Spain'

In [181]:
df_people

,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French,130.0
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English,123.0
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English,1500.0
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python,120.0
4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish,125.0
5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python,130.0
6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix,130.0
7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English,123.0
8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English,1500.0
9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English,130.0
10,1004,Rosy,Burk,rosy.burk@email,Spain,head office,Admin,cwx,Finish;English;Python,105.0

In [139]:
def cal_sal(country):
    if country == 'USA':
        return 100+100*.3
    elif country == 'Germany':
        return 100+100*.25
    elif country == 'Canada':
        return 100+100*.20
    elif country =='India':
        return 100*100*.15
    elif country=='UK':
        return 100+.23*100
    else:
        return 100+100*.05

In [180]:
df_people['salary'] = df_people['country'].apply(cal_sal)

In [188]:
df_people

,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French,130.0
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English,123.0
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English,1500.0
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python,120.0
4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish,125.0
5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python,130.0
6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix,130.0
7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English,123.0
8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English,1500.0
9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English,130.0
10,1004,Rosy,Burk,rosy.burk@email,Spain,head office,Admin,cwx,Finish;English;Python,105.0

In [ ]:
def email_case(email):
    return email.upper()

#email_case(df_people['email']) this will fail with erro that 'Series' object has no attribute 'upper' instead use the apply

In [ ]:
mydf['salary'] = mydf['country'].apply(cal_sal)

In [ ]:
#df_people['email'].apply(email_case) #to apply the changes assign it to series as below
df_people['email'] = df_people['email'].apply(email_case)

In [ ]:
df_people

In [ ]:
#you can also directly use the lambda to run the no name function in apply
df_people['email'] = df_people['email'].apply(lambda x: x.upper())
#use applymap to apply the change to entire df non integer columns
df_people[['email','emp_type','country','work_mode']].applymap(lambda x: x.lower())
df_people #email changes back to lower case require re-assignment df_people[['email','emp_type','country','work_mode']] =

In [186]:
df_people.apply(len, axis='columns')
#this tells numbers of columns in each row, axis='rows' is default

0     10
1     10
2     10
3     10
4     10
5     10
6     10
7     10
8     10
9     10
10    10
dtype: int64

In [193]:
df_people.apply(len, axis='rows')
df_people[['email','fname']].applymap(len)

    email  fname
0      15      4
1      15      3
2      15      5
3      15      4
4      10      4
5      18      4
6      19      5
7      19      3
8      21      3
9      12      5
10     15      4

In [194]:
df_people[['email','dept']] = df_people[['email','dept']].applymap(lambda x: x.upper())
df_people

,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,emp,English;French,130.0
1,1003,Tom,Alter,TOM.ALTER@EMAIL,UK,work from home,SALES,cwx,Spanish;French;English,123.0
2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,emp,Dutch;English,1500.0
3,1004,Rosy,Burk,ROSY.BURK@EMAIL,Canada,head office,ADMIN,cwx,Finish;English;Python,120.0
4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,emp,English;Hindi;Java:Spanish,125.0
5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,emp,English:SQL:Python,130.0
6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,130.0
7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,emp,Hindi;Python-English,123.0
8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,emp,Dutch;Swiss;English,1500.0
9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,emp,English,130.0
10,1004,Rosy,Burk,ROSY.BURK@EMAIL,Spain,head office,ADMIN,cwx,Finish;English;Python,105.0

# applymap used to apply a function to every element of dataframe 
applymap only works on DF not on Series
unlike apply(len) on df gives number of element in each series applymap gives us the lenght of each column value

In [195]:
# IF DataFrame is full of str columns then applymap will work
#note this throw error if Df have number type column so here, id is changing to index to avoid error
#df_people.set_index('id', inplace=True)
df_people.applymap(len) #>=10 conditional

TypeError: object of type 'int' has no len()

In [ ]:
#MAP is generally used to substitute the Series column values, note if any value is not matched in map it make is NaN
# this method is good to converted if you column value like Yes/No and convert it to True/False
#else use the rename

In [ ]:
df_people['fname']=='Jack'

In [ ]:
#dataframe column condition return the record with Boolean value for matching record True and rest False]- id is index here so don't get confuse
df_people[df_people['fname']=='Jack'] #['email']

In [ ]:
df_people.set_index('fname', inplace=True)

In [ ]:
#now index is set for fname now you can use the loc on fname to find the records
df_people.loc['Jack']

In [ ]:
df_people.reset_index(inplace=True)

In [ ]:
df_people['lname']=='Dow'

In [198]:
filt = df_people['lname']=='Dow'
#filt = df_people[df_people['lname']=='Dow'] direct dataframe values can not be used as filte
filt

0     False
1     False
2     False
3     False
4     False
5      True
6      True
7     False
8     False
9      True
10    False
Name: lname, dtype: bool

In [200]:
df_people.loc[filt]# you can also chooes the column values as needed

,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,emp,English:SQL:Python,130.0
6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,130.0
9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,emp,English,130.0

~ symbol reverse(NOT) the condition, filt condition become not condition

In [ ]:
df_people.loc[~filt]# you can also chooes the column values as needed

In [199]:
#filter can be used directly to dataframe as well as with loc
#as we know we can also chooes the number of columns we want from dataframe except specific row but loc provide option to 
#select the row along with column values

df_people[filt] [['id','fname','email']].value_counts()

id    fname  email
1006  Jhon   JHON.DOW@EMAIL.COM     1
1007  Jenny  JENNY.DOW@EMAIL.COM    1
1010  Terry  TD@EMAIL.COM           1
dtype: int64

In [ ]:
df_people.loc[filt, ['fname','lname','email']]

In [ ]:
df_people[df_people['lname']=='Dow']

# Pandas AND and OR Operators (& and |)

In [202]:
df_filter = (df_people['fname']=='Jack') | (df_people['lname']=='Dow')

In [205]:
df_people[df_filter]

,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,emp,English;French,130.0
4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,emp,English;Hindi;Java:Spanish,125.0
5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,emp,English:SQL:Python,130.0
6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,130.0
9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,emp,English,130.0

In [ ]:
#Dataframe isin() method is used to pass the additional filter to dataframe

In [ ]:
country_filter = (df_people['country'].isin(['USA'])) & (df_people['lname']=='Dow')

In [ ]:
#same result for both method
df_people[country_filter]
df_people.loc[country_filter]

# isin() method to validate column values like Oracle in - df['column'].isin([cols value])

In [ ]:
country_filter1 = (df_people['country'].isin(['USA'])) & (df_people['lname']=='Dow') & (df_people['id'] < 1010)
df_people[country_filter1]

In [ ]:
type(country_filter1)

# Dataframe str.contains() method helps to find the specific text in the column
df['column'].str.contain(value)

In [ ]:
lang_fil = (df_people['language'].str.contains('Spanish'))

In [ ]:
# pd.set_option('display.max_rows',25)
#df_people.fillna(-1, inplace=True)

df_people[lang_fil]

# Describe and max(), min() method

In [206]:
df_people[['id','fname','country']].min()
#df_people['id'].max()

id           1001
fname        Jack
country    Canada
dtype: object

In [ ]:
#aggregate DF group by column mentioned
df_people[['fname','work mode']].value_counts()

In [207]:
df_people['id'].max()

1010

In [208]:
#Caution - extract mininum value from Each dataframe column
df_people.apply([pd.Series.min])

,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
min,1001,Jack,Alter,JACK.FOLY@EMAIL,Canada,Office,ADMIN,cwx,Dutch;English,105.0

In [209]:
#use list in case data needed in row else skip the squar bracket to get data in column
df_people.apply([lambda x: x.min()])

,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
<lambda>,1001,Jack,Alter,JACK.FOLY@EMAIL,Canada,Office,ADMIN,cwx,Dutch;English,105.0

In [9]:
#Operation on pandas Series
s = pd.Series([10,12,14,15,18])
a=18
print("Series max value is --> ",s.max())
if s.max()==a:
    print("Series value is equal to variable")

y = (x for x in range(1,20) if x==s.max())
y1 = [x for x in range(1,20) if x==s.max()]
print("value From generator matching Series is --> ", sum(y))
print("Object Y is: ", y, " and Object Y1 is ", type(y1))

Series max value is -->  18
Series value is equal to variable
value From generator matching Series is -->  18
Object Y is:  <generator object <genexpr> at 0x15f80cc10>  and Object Y1 is  <class 'list'>

In [ ]:
#describe the dataframe with basic mean medium std and %tile values for numerical fields
df_people.describe()

In [ ]:
#top 5 record use tail for top bottom records

df_people.head(5)

df_people.tail(5)

# Update Dataframe record values

In [211]:
df_people[(df_people['lname']=='Dow') | (df_people['fname']=='Jenny')]

,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,emp,English:SQL:Python,130.0
6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,130.0
9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,emp,English,130.0

In [ ]:
#updating fname to Ronny

df_people.loc[(df_people['lname']=='Dow') & (df_people['fname']=='Jenny'),['fname','email']] = ['Ronny','ronny.dow@email.com']

In [ ]:
#if you know the index for the record you wish to change
#dataframe.loc[index,[column's-to-update]] = [new-column-value]
df_people.loc[6, ['fname','email']] = ['Rock','rock.dow@email.com']

In [212]:
df_people.loc[df_people['emp_type']=='emp','emp_type'] = 'Emp'

In [213]:
df_people

,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,Emp,English;French,130.0
1,1003,Tom,Alter,TOM.ALTER@EMAIL,UK,work from home,SALES,cwx,Spanish;French;English,123.0
2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,Emp,Dutch;English,1500.0
3,1004,Rosy,Burk,ROSY.BURK@EMAIL,Canada,head office,ADMIN,cwx,Finish;English;Python,120.0
4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,Emp,English;Hindi;Java:Spanish,125.0
5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,Emp,English:SQL:Python,130.0
6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,130.0
7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,Emp,Hindi;Python-English,123.0
8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,Emp,Dutch;Swiss;English,1500.0
9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,Emp,English,130.0
10,1004,Rosy,Burk,ROSY.BURK@EMAIL,Spain,head office,ADMIN,cwx,Finish;English;Python,105.0

In [ ]:
df_people[~((df_people['fname']=='Rock') & (df_people['lname']=='Dow'))]

In [ ]:
df_people[(df_people['fname']=='Rock') & (df_people['lname']=='Dow')]

In [ ]:
#update two column by using index reference
df_people.loc[3,['lname','email']]= ['Dilt','rosy.dilt@email.com']

In [ ]:
#AT can also be use in place of loc --somehow giving error to update multiple column values but values are getting change i guess this ment only for 1 value

#df_people.at[3,['lname','email']]= ['Hanson','rosy.hanson@email.com']
df_people.at[3, 'lname'] = 'Hanson'

In [ ]:
#update column all value to upper or other operation

df_people['emp_type'] = df_people['emp_type'].str.upper()

# apply, map, applymap and replace method

In [215]:
#here find the record and chooes the column and see the lenth of that column value
df_people.loc[df_people['email']=='td@email.com','fname']
df_people.loc[df_people['email']=='td@email.com','fname'].apply(len)

Series([], Name: fname, dtype: object)

In [216]:
df_people.loc[df_people['lname']=='Dow', 'email']

5     JHON.DOW@EMAIL.COM
6    JENNY.DOW@EMAIL.COM
9           TD@EMAIL.COM
Name: email, dtype: object

In [ ]:
df_people.loc[df_people['emp_type']=='cwx','emp_type'].str.upper()
#df_people['emp_type'] = df_people.loc[df_people['emp_type']=='cwx','emp_type'].apply(lambda x: x.upper())

#don't update the dataframe field value as this gives the all DF records with matching and non matching records and for non matching criteria value will update to NaN
dfp['emp_type'] =dfp.loc[df_people['emp_type']=='cwx','emp_type'].str.upper()

In [ ]:
dfp

In [ ]:
df_p = df_people['email'].str.upper()
#this will create new dataframe with selected values
df_p

In [ ]:
#update value for emp field
df_people.loc[df_people['emp_type']!='CWX','emp_type'] = 'Emp'

In [ ]:
df_people['emp_type'] = df_people['emp_type'].str.upper()
df_people

In [ ]:
df_people['emp_type'] = df_people['emp_type'].str.lower()
df_people

In [217]:
people = {
    'id': [1001,1003,1002,1004,1005,1006,1007,1008,1009,1010,'no data'],
    'fname': ['Jack',
              'Tom',
              'Traci','Rosy','Jack','Jhon','Jenny','Tom','Raj','Terry','na'],
    'lname': ['Foly','Alter','Saw','Burk','jack@email','Dow','Dow','Hanks','Saurabh','Dow','Missing'], 
    'email': ['jack.foly@email','tom.alter@email','traci.saw@email','rosy.burk@email','jack@email',
              'jhon.dow@email.com',
              'jenny.dow@email.com',
              'tom.hanks@email.com',
              'saurabh.raj@email.com',
              'td@email.com',
             'Missing'],
    'country':['USA','UK','India','Canada','Germany','USA','USA','UK','India', 'USA','NA'],
    'work mode': ['remote','work from home','office','head office','remote','office','Remote','office','work from home',
                  'Office', None],
    'dept': ['IT','Sales','Marketing','Admin','Sales','Developer','Admin','Sales','VP','Finance','Missing'],
    'emp_type':['emp','cwx','emp','cwx','emp','emp','cwx','emp','emp','emp','na'],
    'language': ['English;French','Spanish;French;English','Dutch;English',
                 'Finish;English;Python','English;Hindi;Java:Spanish','English:SQL:Python',
                 'English;Unix','Hindi;Python-English','Dutch;Swiss;English','English',
                 'Missing'
                ]
         }

In [218]:
#length of the dictionary values in list
len(people['lname'])

11

In [219]:
import pandas as pd
import numpy as np
pdf = pd.DataFrame(people)

In [645]:
pdf.loc[9,'dept'] = 'Office'
#.loc[9, 'language'] = 'Zulu;English'
pdf

,id,fname,lname,email,country,work mode,dept,emp_type,language
0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python
4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish
5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python
6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix
7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English
8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English
9,1010,Terry,Dow,td@email.com,USA,Office,Office,emp,English
10,no data,na,Missing,Missing,NA,None,Missing,na,Missing

In [224]:
pdf[(pdf['lname']=='Dow') | (pdf['fname']=='Tom')]

,id,fname,lname,email,country,work mode,dept,emp_type,language
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python
6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix
7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English
9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English

In [ ]:
# this is good to filter the record but for update it will update for matching row but rest of them become NaN
pdf.loc[f, 'emp_type'].str.upper()

In [225]:
a= None
b=np.nan

if a==b:
    print('Yes')
else:
    print('NaN and None is not equal')

NaN and None is not equal

In [ ]:
pdf['emp_type'] = pdf['emp_type'].str.lower()

In [ ]:
#delete dataframe -- result after executing given del statment 
del pdff

In [ ]:
#get the lenght of the field, remeber here email set as custome index to reference record default is integer index
pdf[['fname','lname']].apply(len)

In [ ]:
#This tell how many record each column have in DF, default axis is rows
pdf.apply(len)

In [ ]:
#this Tells DF have 9 Columns values in each row, except index, incase custom index is set that will not count
pdf.apply(len, axis='columns')

In [ ]:
pdf['fname'].apply(len)

In [ ]:
#minimum character in DF fname column, first is length and 2nd int is occurance as per 

#pdf.set_index('email', inplace=True)
pdf['fname'].apply(len).value_counts()
#pdf['fname'].max()

In [ ]:
pdf['id']

In [ ]:
pd.set_option('display.max_row',25)
pdf

In [231]:
pdf.isnull().any()

id           False
fname        False
lname        False
email        False
country      False
work mode     True
dept         False
emp_type     False
language     False
dtype: bool

In [ ]:
#find NaN value in DF Column
pdf['work mode'].isnull().any()
# find the null value in entire dataframe columns
pdf.isnull().any()

In [ ]:
#update NaN value in DF column as needed
pdf['id'].fillna(0, inplace=True)
pdf.fillna('Missing', inplace=True)
pdf

In [ ]:
# Series min or max with apply() give you the min/max value of each column from dataset
#, since each column in dataset is Series
# remember to use the pd.Series which means apply the pandas Series min/max method on dataframe

pdf.apply(pd.Series.max)
#pdf.replace({'Missing':np.nan, 'None': None, 'na':None, 'NA':None, 'no data': np.nan}, inplace=True)

In [ ]:
#Same can be done by using the lambda

pdf.apply(lambda x: x.max())

In [ ]:
pdf

In [ ]:
#change the value for column values we can use replace method
#update multiple row column values
pdf['lname']= pdf['lname'].replace({'Sharma':'Burk', 'Saurabh':'Kumar'})

In [ ]:
pdf.loc[[3,8]]

# Change column name or rename column name, use inplace=True to apply the change

In [ ]:
#pdf.rename(columns = {'id':'emp_id'}, inplace=True)
#update column header name DataFrame.rename(colums = {'existing_name':'new_name'})
pdf.rename(columns = {'id':'emp_id'})

In [ ]:
pdf

# Insert and update Records
# Handling Null value in Df
# dropna(axis=index/columns, how='all/any')
all= delete row or column when all values are null
any = delete row or column when any value in df is null/NaN

In [232]:
import numpy as np
emp_data = {'fname': ['sample','Jack',np.nan,'Traci','Rosy','Jack','Jhon','NULL','Tom','Raj','Terry'],
            'lname': [np.nan,'Foly','NA',np.nan,'NA','jack@email','Dow','Dow','Hanks','Saurabh','Missing'], 
            'email': [np.nan,'jack.foly@email',None,'traci.saw@email','rosy.burk@email','jack@email','jhon.dow@email.com','jenny.dow@email.com','tom.hanks@email.com','saurabh.raj@email.com','td@email.com'],
            'age':[15,10,np.nan,11,23,45,65,43,2,4,None],
            'zip':[10001,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,'NA']
           }

In [233]:
ndf = pd.DataFrame(emp_data)
pd.set_option('display.max_rows',12)
#display at least 12 rows for all DF its not only for this

In [236]:
ndf
#ndf.loc[9]=None

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NA,None,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,NaN
5,Jack,jack@email,jack@email,45.0,NaN,NaN,NaN
6,Jhon,Dow,jhon.dow@email.com,65.0,NaN,NaN,NaN
7,NULL,Dow,jenny.dow@email.com,43.0,NaN,NaN,NaN
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,Missing,td@email.com,NaN,NA,NaN,NaN
11,NAKumar,NaN,MissingNA@email.com,NaN,NaN,NAMissing None,None

In [235]:
ndf=ndf.append({'full_name':'NAMissing None','fname':'NAKumar','email':'MissingNA@email.com','gender':None}, ignore_index=True)
ndf

/var/folders/l5/0hgvlxrn1q9cm7g8sk6xxnr00000gn/T/ipykernel_1314/3004757393.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ndf=ndf.append({'full_name':'NAMissing None','fname':'NAKumar','email':'MissingNA@email.com','gender':None}, ignore_index=True)

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NA,None,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,NaN
5,Jack,jack@email,jack@email,45.0,NaN,NaN,NaN
6,Jhon,Dow,jhon.dow@email.com,65.0,NaN,NaN,NaN
7,NULL,Dow,jenny.dow@email.com,43.0,NaN,NaN,NaN
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,Missing,td@email.com,NaN,NA,NaN,NaN
11,NAKumar,NaN,MissingNA@email.com,NaN,NaN,NAMissing None,None

In [242]:
ndf = ndf.append({'lname':'Raj','age':15}, ignore_index=True)
ndf

/var/folders/l5/0hgvlxrn1q9cm7g8sk6xxnr00000gn/T/ipykernel_1314/2646066904.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ndf = ndf.append({'lname':'Raj','age':15}, ignore_index=True)

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NA,None,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,Missing,td@email.com,NaN,NA,NaN,NaN
11,NAKumar,NaN,MissingNA@email.com,NaN,NaN,NAMissing None,None
12,NaN,Raj,NaN,15.0,NaN,NaN,NaN

In [253]:
ndf.dropna(axis='index', how='all', subset=['email','fname'])

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,NaN
5,Jack,jack@email,jack@email,45.0,NaN,NaN,NaN
6,Jhon,Dow,jhon.dow@email.com,65.0,NaN,NaN,NaN
7,NULL,Dow,jenny.dow@email.com,43.0,NaN,NaN,NaN
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,Missing,td@email.com,NaN,NA,NaN,NaN
11,NAKumar,NaN,MissingNA@email.com,NaN,NaN,NAMissing None,None

In [255]:
ndf

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NA,None,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,Missing,td@email.com,NaN,NA,NaN,NaN
11,NAKumar,NaN,noemp@email.com,NaN,NaN,NAMissing None,NaN
12,NaN,Raj,NaN,15.0,NaN,NaN,NaN

In [ ]:
cond = ndf['email']=='MissingNA@email.com'

In [ ]:
ndf.drop(index=ndf[cond].index)

In [256]:
ndf['email'].replace({'noemp@email.com': 'MissingNA@email.com'}, inplace=True, method='bfill')

In [257]:
ndf

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NA,None,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,Missing,td@email.com,NaN,NA,NaN,NaN
11,NAKumar,NaN,MissingNA@email.com,NaN,NaN,NAMissing None,NaN
12,NaN,Raj,NaN,15.0,NaN,NaN,NaN

In [ ]:
ndf.replace({None:'np.nan','Missing':np.nan,None:np.nan})

In [ ]:
#Replace dataset custom null/na/missing values
#remember if no dataframe column specified in this case it will search value in all DF columns for replacement

ndf.replace({'NA':np.nan, None:np.nan, 'Missing':np.nan})
#after reviewing DF changes, use inplace=True to make permanent changes in DF

# here entire zip field is dropped because of how='all' option, with 'any' option all df records will dropped because in df have NaN/None value in each column

In [ ]:
ndf.dropna(axis='columns', how='all')

#Conditionally deletion of rows and columns for
# Conditon 1 - eg. delete 'na' rows if lname or email is null
# here 'HOW" play important role to drop after evaluating the list of cols in subset if how set to all in this case conditon will evalueate all the subset cols needs to be null to drop from df check Condition 2

In [ ]:
ndf.dropna(axis='index', how='any', subset=['lname','email'])

In [ ]:
ndf.replace({'NA':np.nan, 'NULL':np.nan,None:np.nan})

In [ ]:
ndf

# condition 2 - drop row when lname and email both are missing

In [ ]:
ndf.dropna(axis='index', how='all', subset=['lname','email'])
# use inplace = True to update the dataframe with your changes

In [ ]:
# search  NaN value in DF

ndf.isna()

In [ ]:
#update NaN value with text or number
ndf.fillna("missing")
ndf.fillna(-1)

In [ ]:
#ndf.replace({-1,np.nan}, inplace=True)

ndf.dtypes

# convert df column datatype use df[column].astype(float/int)

# check df column datatype df.dtype()

In [ ]:
#zip column in DF is object type reason being mathmatical function can not be performed
#in this case this column need to be cast to int / float to do that, first string or null values need to be handled

ndf['zip'].replace({'NA':0}, inplace=True)
ndf['zip'].astype(float)

In [ ]:
ndf['zip'].mean()

# ADD / Delete column from DataFrame

In [667]:
#adding new column full_name

ndf['full_name'] = ndf['fname'] +' '+ ndf['lname']

In [668]:
# ndf.drop(columns='full_name', inplace=True)
ndf

,fname,lname,email,age,zip,gender,full_name
0,sample,NaN,NaN,15.0,10001,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,Jack Foly
2,NaN,NA,None,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,Rosy NA
...,...,...,...,...,...,...,...
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,Tom Hanks
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,Raj Saurabh
10,Terry,Missing,td@email.com,NaN,NA,NaN,Terry Missing
11,NAKumar,NaN,MissingNA@email.com,NaN,NaN,NaN,NaN
12,NaN,Raj,NaN,15.0,NaN,NaN,NaN

In [ ]:
#str.split method to re-add fname and lname column in df
ndf['full_name'].str.split(' ')

In [ ]:
#this will seperate the value in columns structure that can be addded to df in next 
ndf[['fname','lname']] = ndf['full_name'].str.split(' ', expand=True)

In [ ]:
# Adding Two column in DF
ndf[['fname','lname']] = ndf['full_name'].str.split(' ', expand=True)

In [ ]:
ndf

In [ ]:
#add column in df
ndf['gender']=np.nan

In [ ]:
#add row use df.append(obj, ignore_index=True, sort=False/True)
ndf

In [ ]:
#insert record, Remember to assign the value to DF other wise insert will not take effect

ndf = ndf.append({'fname':'Rosy','lname':'Wakeford'}, ignore_index=True)

In [ ]:
#this is adding two column in DF
ndf1 = ndf
ndf1[['gender','full_name']]= [np.nan, ndf1['fname'] + ' ' + ndf1['lname']]

In [646]:
ndf

,fname,lname,email,age,zip,full_name,gender
0,sample,NaN,NaN,15.0,10001,NaN,NaN
1,Jack,Foly,jack.foly@email,10.0,NaN,NaN,NaN
2,NaN,NA,None,NaN,NaN,NaN,NaN
3,Traci,NaN,traci.saw@email,11.0,NaN,NaN,NaN
4,Rosy,NA,rosy.burk@email,23.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...
8,Tom,Hanks,tom.hanks@email.com,2.0,NaN,NaN,NaN
9,Raj,Saurabh,saurabh.raj@email.com,4.0,NaN,NaN,NaN
10,Terry,Missing,td@email.com,NaN,NA,NaN,NaN
11,NAKumar,NaN,MissingNA@email.com,NaN,NaN,NAMissing None,NaN
12,NaN,Raj,NaN,15.0,NaN,NaN,NaN

# Merging dataset adding dataset inserting another dataset to main df

In [ ]:
#adding/combining dataframe 
#Use one of the DF to include those change otherwise this remain view only, eg. ndf = pd.append(df,ignore_index=True, sort=False)
pd.set_option('display.max_rows',33)
ndf = ndf.append(ndf1, ignore_index=True, sort=False)

In [ ]:
ndf1

# Drop column

In [ ]:
# Drop Columns
#drop fname and lname column from dataframe
#inplace=True to commit changes to DF

ndf.drop(columns = ['lname','fname'], inplace = True)

In [ ]:
ndf

# Drop Row

In [ ]:
ndf1.drop(index=7, inplace=True)

In [ ]:
# Delete row from Dataframe
# axis(0=row, 1=columns) inplace True perform operation DF itself and return none without it return the copy
# df_people.drop([1,2,3,9], axis=0)
ndf.drop(index=0, inplace=True)

In [ ]:
# 2nd way to use the filter or conditional deletion

fi = ndf['lname']=='Wakeford'
ndf[fi].index

In [ ]:
ndf.drop(index=ndf[fi].index, inplace=True)

In [ ]:
ndf

In [ ]:
# Delete column drop column
ndf1.drop(columns=['fname','lname'], inplace=True)

In [ ]:
ndf1

In [ ]:
#df_people.loc[df_people['lname']=='jack@email',['lname','email']] =['Son','jack.son@email.com']
#df_people['full_name'] = df_people['fname'] + ' ' + df_people['lname']
df_people

# Sort data in dataframe - two way sort index or short by column value
# use inplace=True to keep sorted data in DF

In [ ]:
#sort by Index you can sort in decending by making ascending = True
df_people.sort_index(ascending=False)

In [ ]:
#Ascending order is default sort order
df_people.sort_values(by=['fname'], ascending=False)

In [297]:
df_people.sort_values(by=['fname','lname'], ascending=False)

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
2,2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,Emp,Dutch;English,3000.0
7,7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,Emp,Hindi;Python-English,861.0
1,1,1003,Tom,Alter,TOM.ALTER@EMAIL,UK,work from home,SALES,cwx,Spanish;French;English,123.0
9,9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,Emp,English,1170.0
3,3,1004,Rosy,Burk,ROSY.BURK@EMAIL,Canada,head office,ADMIN,cwx,Finish;English;Python,360.0
10,10,1004,Rosy,Burk,ROSY.BURK@EMAIL,Spain,head office,ADMIN,cwx,Finish;English;Python,1050.0
8,8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,Emp,Dutch;Swiss;English,12000.0
5,5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,Emp,English:SQL:Python,650.0
6,6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,780.0
4,4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,Emp,English;Hindi;Java:Spanish,500.0
0,0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,Emp,English;French,0.0

In [296]:
#complecate sort on different columns
#Use Case - sort first name asceding than lname decending order
df_people.sort_values(['fname','lname'], ascending=[False, True])

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
2,2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,Emp,Dutch;English,3000.0
1,1,1003,Tom,Alter,TOM.ALTER@EMAIL,UK,work from home,SALES,cwx,Spanish;French;English,123.0
7,7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,Emp,Hindi;Python-English,861.0
9,9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,Emp,English,1170.0
3,3,1004,Rosy,Burk,ROSY.BURK@EMAIL,Canada,head office,ADMIN,cwx,Finish;English;Python,360.0
10,10,1004,Rosy,Burk,ROSY.BURK@EMAIL,Spain,head office,ADMIN,cwx,Finish;English;Python,1050.0
8,8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,Emp,Dutch;Swiss;English,12000.0
5,5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,Emp,English:SQL:Python,650.0
6,6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,780.0
0,0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,Emp,English;French,0.0
4,4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,Emp,English;Hindi;Java:Spanish,500.0

In [ ]:
#adding column to DF
df_people['salary']=1000

In [ ]:
#updating each column
df_people.loc[0,'salary']=3500
df_people.loc[7,'salary']=5500

In [258]:
df_people.reset_index(inplace=True)
df_people['salary']= (df_people['salary'] * df_people['salary'].index)

In [299]:
df_people.sort_values('salary')

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
0,0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,Emp,English;French,0.0
1,1,1003,Tom,Alter,TOM.ALTER@EMAIL,UK,work from home,SALES,cwx,Spanish;French;English,123.0
3,3,1004,Rosy,Burk,ROSY.BURK@EMAIL,Canada,head office,ADMIN,cwx,Finish;English;Python,360.0
4,4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,Emp,English;Hindi;Java:Spanish,500.0
5,5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,Emp,English:SQL:Python,650.0
6,6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,780.0
7,7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,Emp,Hindi;Python-English,861.0
10,10,1004,Rosy,Burk,ROSY.BURK@EMAIL,Spain,head office,ADMIN,cwx,Finish;English;Python,1050.0
9,9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,Emp,English,1170.0
2,2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,Emp,Dutch;English,3000.0
8,8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,Emp,Dutch;Swiss;English,12000.0

In [272]:
df_people['salary'].nlargest(5)

8     12000.0
2      3000.0
9      1170.0
10     1050.0
7       861.0
Name: salary, dtype: float64

In [277]:
#top and bottom 5 rows
top5_sal_df = df_people.loc[df_people['salary'].nlargest(5).index]
df_people.loc[df_people['salary'].nlargest(5).index]

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
8,8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,Emp,Dutch;Swiss;English,12000.0
2,2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,Emp,Dutch;English,3000.0
9,9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,Emp,English,1170.0
10,10,1004,Rosy,Burk,ROSY.BURK@EMAIL,Spain,head office,ADMIN,cwx,Finish;English;Python,1050.0
7,7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,Emp,Hindi;Python-English,861.0

In [283]:
# bottom 5 salary
# df_people['salary'].nsmallest(5).index.max()

low5_sal_df = df_people.loc[df_people['salary'].nsmallest(5).index]
df_people.loc[df_people['salary'].nsmallest(5).index]

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
0,0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,Emp,English;French,0.0
1,1,1003,Tom,Alter,TOM.ALTER@EMAIL,UK,work from home,SALES,cwx,Spanish;French;English,123.0
3,3,1004,Rosy,Burk,ROSY.BURK@EMAIL,Canada,head office,ADMIN,cwx,Finish;English;Python,360.0
4,4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,Emp,English;Hindi;Java:Spanish,500.0
5,5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,Emp,English:SQL:Python,650.0

In [293]:
newdf = pd.concat([top5_sal_df, low5_sal_df], ignore_index=False)
newdf
# newdf.reset_index()

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
8,8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,Emp,Dutch;Swiss;English,12000.0
2,2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,Emp,Dutch;English,3000.0
9,9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,Emp,English,1170.0
10,10,1004,Rosy,Burk,ROSY.BURK@EMAIL,Spain,head office,ADMIN,cwx,Finish;English;Python,1050.0
7,7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,Emp,Hindi;Python-English,861.0
0,0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,Emp,English;French,0.0
1,1,1003,Tom,Alter,TOM.ALTER@EMAIL,UK,work from home,SALES,cwx,Spanish;French;English,123.0
3,3,1004,Rosy,Burk,ROSY.BURK@EMAIL,Canada,head office,ADMIN,cwx,Finish;English;Python,360.0
4,4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,Emp,English;Hindi;Java:Spanish,500.0
5,5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,Emp,English:SQL:Python,650.0

In [294]:
#complete dataset with top and bottom 5

df_people.nlargest(5, 'salary')

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
8,8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,Emp,Dutch;Swiss;English,12000.0
2,2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,Emp,Dutch;English,3000.0
9,9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,Emp,English,1170.0
10,10,1004,Rosy,Burk,ROSY.BURK@EMAIL,Spain,head office,ADMIN,cwx,Finish;English;Python,1050.0
7,7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,Emp,Hindi;Python-English,861.0

In [295]:
df_people.nsmallest(5, 'salary')

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
0,0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,Emp,English;French,0.0
1,1,1003,Tom,Alter,TOM.ALTER@EMAIL,UK,work from home,SALES,cwx,Spanish;French;English,123.0
3,3,1004,Rosy,Burk,ROSY.BURK@EMAIL,Canada,head office,ADMIN,cwx,Finish;English;Python,360.0
4,4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,Emp,English;Hindi;Java:Spanish,500.0
5,5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,Emp,English:SQL:Python,650.0

# Grouping and Aggregation
## you may see the KeyError: ('India', 'cxw') if any of key value doesn't exists in DF grp

In [298]:
df_people['salary'].median()

780.0

In [560]:
df_people

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
0,0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,Emp,English;French,0.0
1,1,1003,Tom,Alter,TOM.ALTER@EMAIL,UK,work from home,SALES,cwx,Spanish;French;English,123.0
2,2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,Emp,Dutch;English,3000.0
3,3,1004,Rosy,Burk,ROSY.BURK@EMAIL,Canada,head office,ADMIN,cwx,Finish;English;Python,360.0
4,4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,Emp,English;Hindi;Java:Spanish,500.0
5,5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,Emp,English:SQL:Python,650.0
6,6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,780.0
7,7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,Emp,Hindi;Python-English,861.0
8,8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,Emp,Dutch;Swiss;English,12000.0
9,9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,Emp,English,1170.0
10,10,1004,Rosy,Burk,ROSY.BURK@EMAIL,Spain,head office,ADMIN,cwx,Finish;English;Python,1050.0

In [563]:
df_people.sort_values(by=['fname','country'], ascending=[True,False])

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
0,0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,Emp,English;French,0.0
4,4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,Emp,English;Hindi;Java:Spanish,500.0
6,6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,780.0
5,5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,Emp,English:SQL:Python,650.0
8,8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,Emp,Dutch;Swiss;English,12000.0
10,10,1004,Rosy,Burk,ROSY.BURK@EMAIL,Spain,head office,ADMIN,cwx,Finish;English;Python,1050.0
3,3,1004,Rosy,Burk,ROSY.BURK@EMAIL,Canada,head office,ADMIN,cwx,Finish;English;Python,360.0
9,9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,Emp,English,1170.0
1,1,1003,Tom,Alter,TOM.ALTER@EMAIL,UK,work from home,SALES,cwx,Spanish;French;English,123.0
7,7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,Emp,Hindi;Python-English,861.0
2,2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,Emp,Dutch;English,3000.0

In [300]:
#default sorting order is ascending, if you want to sort values by decending use ('salary', ascending=False)
df_people.sort_values('salary', ascending=False)

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
8,8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,Emp,Dutch;Swiss;English,12000.0
2,2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,Emp,Dutch;English,3000.0
9,9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,Emp,English,1170.0
10,10,1004,Rosy,Burk,ROSY.BURK@EMAIL,Spain,head office,ADMIN,cwx,Finish;English;Python,1050.0
7,7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,Emp,Hindi;Python-English,861.0
6,6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,780.0
5,5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,Emp,English:SQL:Python,650.0
4,4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,Emp,English;Hindi;Java:Spanish,500.0
3,3,1004,Rosy,Burk,ROSY.BURK@EMAIL,Canada,head office,ADMIN,cwx,Finish;English;Python,360.0
1,1,1003,Tom,Alter,TOM.ALTER@EMAIL,UK,work from home,SALES,cwx,Spanish;French;English,123.0
0,0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,Emp,English;French,0.0

In [301]:
#merged_df = ndf.append(df_people, ignore_index=True)

In [303]:
df_people['salary'].median()
# df_people

780.0

In [308]:
fil = df_people['country']=='USA'
df_people.loc[fil, ['emp_type','salary']].value_counts()

emp_type  salary
Emp       0.0       1
          650.0     1
          1170.0    1
cwx       780.0     1
dtype: int64

In [477]:
grp_country = df_people.groupby(['country'])
# df_grp = df_people.groupby(['country','emp_type'])

In [529]:
df_grp['salary'].value_counts().loc[['India'],['Emp']]
# df_grp['dept'].value_counts().loc[['USA'],['Emp']]

country  emp_type  salary
India    Emp       3000.0     1
                   12000.0    1
Name: salary, dtype: int64

In [557]:
df_people[(df_people['country']=='India') & (df_people['emp_type']=='Emp')].value_counts(df_people['salary'])

salary
3000.0     1
12000.0    1
dtype: int64

In [565]:
df_grp['dept'].value_counts().loc[['USA'],['cwx']]

country  emp_type  dept
USA      cwx       ADMIN    1
Name: dept, dtype: int64

# Multiple countries in groupby multiple choice

In [571]:
df_grp['dept'].value_counts().loc[['India','USA'],['Emp','cwx']]

country  emp_type  dept
India    Emp       MARKETING    1
                   VP           1
USA      Emp       DEVELOPER    1
                   FINANCE      1
                   IT           1
         cwx       ADMIN        1
Name: dept, dtype: int64

In [417]:
df_grp['emp_type'].value_counts().loc[['UK'],['Emp']]

country  emp_type  emp_type
UK       Emp       Emp         1
Name: emp_type, dtype: int64

In [462]:
# df_grp.get_group(('USA','Emp'))
df_grp.get_group(('India','Emp'))

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
2,2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,Emp,Dutch;English,3000.0
8,8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,Emp,Dutch;Swiss;English,12000.0

In [472]:
df_grp[['work mode', 'email']].value_counts().loc['India']
df_grp[['work mode', 'email']].value_counts().loc[['USA']]

country  emp_type  work mode  email
USA      Emp       Office     TD@EMAIL.COM           1
                   office     JHON.DOW@EMAIL.COM     1
                   remote     JACK.FOLY@EMAIL        1
         cwx       Remote     JENNY.DOW@EMAIL.COM    1
dtype: int64

In [354]:
#country, emp_type column become index when df_grp was created for groupby country, emp_type
#you can created partition the df for one column by grouping country
df_grp['salary'].mean().loc[['India','USA']]
df_grp['dept',''].value_counts().loc[['India','USA']]

country  emp_type  index  id    fname  lname    email                  work mode       dept       language             salary
India    Emp       2      1002  Traci  Saw      TRACI.SAW@EMAIL        office          MARKETING  Dutch;English        3000.0     1
                   8      1009  Raj    Saurabh  SAURABH.RAJ@EMAIL.COM  work from home  VP         Dutch;Swiss;English  12000.0    1
USA      Emp       0      1001  Jack   Foly     JACK.FOLY@EMAIL        remote          IT         English;French       0.0        1
                   5      1006  Jhon   Dow      JHON.DOW@EMAIL.COM     office          DEVELOPER  English:SQL:Python   650.0      1
                   9      1010  Terry  Dow      TD@EMAIL.COM           Office          FINANCE    English              1170.0     1
         cwx       6      1007  Jenny  Dow      JENNY.DOW@EMAIL.COM    Remote          ADMIN      English;Unix         780.0      1
dtype: int64

In [371]:
df_grp['salary'].value_counts().loc[['India','USA']]

country  emp_type  salary
India    Emp       3000.0     1
                   12000.0    1
USA      Emp       0.0        1
                   650.0      1
                   1170.0     1
         cwx       780.0      1
Name: salary, dtype: int64

In [ ]:
df_grp['salary'].mean().loc[['India','USA']]

In [478]:
grp_country = df_people.groupby(df_people['country'])

In [479]:
grp_country.get_group('USA')

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
0,0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,Emp,English;French,0.0
5,5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,Emp,English:SQL:Python,650.0
6,6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,780.0
9,9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,Emp,English,1170.0

In [481]:
grp_country.get_group('USA').median()

/var/folders/l5/0hgvlxrn1q9cm7g8sk6xxnr00000gn/T/ipykernel_1314/2828092444.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  grp_country.get_group('USA').median()

index        5.5
id        1006.5
salary     715.0
dtype: float64

In [483]:
grp_country.get_group('USA').sum()#

index                                                       20
id                                                        4024
fname                                       JackJhonJennyTerry
lname                                            FolyDowDowDow
email        JACK.FOLY@EMAILJHON.DOW@EMAIL.COMJENNY.DOW@EMA...
country                                           USAUSAUSAUSA
work mode                             remoteofficeRemoteOffice
dept                                   ITDEVELOPERADMINFINANCE
emp_type                                          EmpEmpcwxEmp
language     English;FrenchEnglish:SQL:PythonEnglish;UnixEn...
salary                                                  2600.0
dtype: object

In [ ]:
grp_country['salary'].mean().loc[['USA', 'India']]

In [ ]:
#multiple statics


d = grp_country['salary'].agg(['mean','median','min','max']).loc[['India','USA','Canada']]

In [ ]:
type(d)
d

In [484]:
pd.set_option('display.max_columns',25)
grp_country.describe()

        index                                                    id          \
        count  mean       std   min    25%   50%    75%   max count    mean
country
Canada    1.0   3.0       NaN   3.0   3.00   3.0   3.00   3.0   1.0  1004.0
Germany   1.0   4.0       NaN   4.0   4.00   4.0   4.00   4.0   1.0  1005.0
India     2.0   5.0  4.242641   2.0   3.50   5.0   6.50   8.0   2.0  1005.5
Spain     1.0  10.0       NaN  10.0  10.00  10.0  10.00  10.0   1.0  1004.0
UK        2.0   4.0  4.242641   1.0   2.50   4.0   5.50   7.0   2.0  1005.5
USA       4.0   5.0  3.741657   0.0   3.75   5.5   6.75   9.0   4.0  1006.0

                                                            salary          \
              std     min      25%     50%      75%     max  count    mean
country
Canada        NaN  1004.0  1004.00  1004.0  1004.00  1004.0    1.0   360.0
Germany       NaN  1005.0  1005.00  1005.0  1005.00  1005.0    1.0   500.0
India    4.949747  1002.0  1003.75  1005.5  1007.25  1009.0    2.0  7500.0
Spain         NaN  1004.0  1004.00  1004.0  1004.00  1004.0    1.0  1050.0
UK       3.535534  1003.0  1004.25  1005.5  1006.75  1008.0    2.0   492.0
USA      3.741657  1001.0  1004.75  1006.5  1007.75  1010.0    4.0   650.0


                 std     min     25%     50%     75%      max
country
Canada           NaN   360.0   360.0   360.0   360.0    360.0
Germany          NaN   500.0   500.0   500.0   500.0    500.0
India    6363.961031  3000.0  5250.0  7500.0  9750.0  12000.0
Spain            NaN  1050.0  1050.0  1050.0  1050.0   1050.0
UK        521.844805   123.0   307.5   492.0   676.5    861.0
USA       486.415460     0.0   487.5   715.0   877.5   1170.0

In [485]:
df_people

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
0,0,1001,Jack,Foly,JACK.FOLY@EMAIL,USA,remote,IT,Emp,English;French,0.0
1,1,1003,Tom,Alter,TOM.ALTER@EMAIL,UK,work from home,SALES,cwx,Spanish;French;English,123.0
2,2,1002,Traci,Saw,TRACI.SAW@EMAIL,India,office,MARKETING,Emp,Dutch;English,3000.0
3,3,1004,Rosy,Burk,ROSY.BURK@EMAIL,Canada,head office,ADMIN,cwx,Finish;English;Python,360.0
4,4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,Emp,English;Hindi;Java:Spanish,500.0
5,5,1006,Jhon,Dow,JHON.DOW@EMAIL.COM,USA,office,DEVELOPER,Emp,English:SQL:Python,650.0
6,6,1007,Jenny,Dow,JENNY.DOW@EMAIL.COM,USA,Remote,ADMIN,cwx,English;Unix,780.0
7,7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,Emp,Hindi;Python-English,861.0
8,8,1009,Raj,Saurabh,SAURABH.RAJ@EMAIL.COM,India,work from home,VP,Emp,Dutch;Swiss;English,12000.0
9,9,1010,Terry,Dow,TD@EMAIL.COM,USA,Office,FINANCE,Emp,English,1170.0
10,10,1004,Rosy,Burk,ROSY.BURK@EMAIL,Spain,head office,ADMIN,cwx,Finish;English;Python,1050.0

In [ ]:
df_people.drop(columns='level_0', inplace=True)

In [493]:
#Find people know swiss?
# lf = df_people['language'].str.contains('Hindi')
df_people[df_people['language'].str.contains('Hindi')]

,index,id,fname,lname,email,country,work mode,dept,emp_type,language,salary
4,4,1005,Jack,jack@email,JACK@EMAIL,Germany,remote,SALES,Emp,English;Hindi;Java:Spanish,500.0
7,7,1008,Tom,Hanks,TOM.HANKS@EMAIL.COM,UK,office,SALES,Emp,Hindi;Python-English,861.0

In [ ]:
#df_people[df_people['language'].str.contains('Hindi')]
#df_people.drop(columns='index',inplace=True)
#df_people.reset_index(inplace=True)
#df_people.drop(index=11, inplace=True)
#df_people.drop(index=10, inplace=True)
df_people.loc[df_people['language'].str.contains('Swiss')]

In [499]:
#total number of emp by country

tot_emp = df_people['country'].value_counts()

In [500]:
tot_emp

USA        4
UK         2
India      2
Canada     1
Germany    1
Spain      1
Name: country, dtype: int64

In [502]:
#create group by country
lang_grp = df_people.groupby('country')

In [503]:
# this gives us the count of the column in group with its values
lang_grp['language'].value_counts()
# this count the occurance of column itsself without creating new column for count including T|F
lang_grp['language'].apply(lambda x: x.str.contains('Hindi').count())

country
Canada     1
Germany    1
India      2
Spain      1
UK         2
USA        4
Name: language, dtype: int64

# sum add the the bool True value where count count the bool value irrespective to T|F as we can see in above example

In [504]:
lang_grp['language'].apply(lambda x: x.str.contains('Hindi').sum())
#you will get true or false for country have language in condition and sum is the function to add the bool true value

country
Canada     0
Germany    1
India      0
Spain      0
UK         1
USA        0
Name: language, dtype: int64

# For string column it will add the value like 'EmpEmp'

In [509]:

lang_grp['salary'].sum().loc['India']

15000.0

In [510]:
#creating series with result sum addup True value as False is not considered to sum
lang = lang_grp['language'].apply(lambda x: x.str.contains('Hindi').sum())
lang

country
Canada     0
Germany    1
India      0
Spain      0
UK         1
USA        0
Name: language, dtype: int64

In [511]:
# df_people['language'].apply(lambda x: x.str.contains('Hindi').sum())
# lang_grp['language'].value_counts()
df_people.loc[df_people['language'].str.contains('Hindi'),'country']

4    Germany
7         UK
Name: country, dtype: object

In [527]:
comp_df = pd.concat([tot_emp,lang], axis=True, sort=False)
#hin

In [528]:
comp_df

         country  language
USA            4         0
UK             2         1
India          2         0
Canada         1         0
Germany        1         1
Spain          1         0

In [ ]:
df_people

In [ ]:
fil = df_people.loc[df_people['language'].str.contains('Hindi'), 'country'].value_counts()
fil

In [ ]:
mydf = pd.concat([tot_emp,fil], axis=True, sort=False)
mydf

In [ ]:
mydf.columns

In [ ]:
comp_df['%HindiSpeaker'] = (comp_df['language']/comp_df['country'])*100

In [ ]:
comp_df

In [ ]:
df_people['country'].value_counts(normalize=True)

In [ ]:
lang_grp[['emp_type']].value_counts()

# Merge DataFrame 
options to merge dataframe horizontilly or vertically
option1 - use pd.concat and use the axis how to merge (0- rows, 1-column side by side)
Option2- only to append df to anohter df use append()method

In [ ]:
import pandas as pd
import numpy as np

In [588]:
df1 = pd.DataFrame(
{
    'A':['A0','B0','C0'],
    'B':['A1','B1','C1'],
    'C':['A2','B2','C2']
}, index=[2,4,6])

df2 = pd.DataFrame(
{
    'E':['E0','E0','E0'],
    'F':['E1','E1','E1'],
    'G':['E2','E2','E2']
}, index=[1,3,5])

df3 = pd.DataFrame(
{
    'E':['E0','E0','E0'],
    'F':['E1','E1','E1'],
    'G':['E2','E2','E2']
}, index=[5,8,7])

In [574]:
df1

    A   B   C
2  A0  A1  A2
4  B0  B1  B2
6  C0  C1  C2

In [589]:
df2
df3

    E   F   G
5  E0  E1  E2
8  E0  E1  E2
7  E0  E1  E2

In [586]:
#ignore_index (False - keep the original index value) and (True - will reset to default index [start from 0])
df2.append(df3, ignore_index=False)

/var/folders/l5/0hgvlxrn1q9cm7g8sk6xxnr00000gn/T/ipykernel_1314/995932028.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2.append(df3, ignore_index=False)

    E   F   G
1  E0  E1  E2
3  E0  E1  E2
5  E0  E1  E2
9  E0  E1  E2
8  E0  E1  E2
7  E0  E1  E2

In [592]:
#concat resule same as append
df = pd.concat([df1,df2,df3], ignore_index=False, sort=False)

# Find duplicate index in dataframe

In [659]:
df.loc[(df.index.value_counts() >1) ==True].index

Int64Index([5, 5], dtype='int64')

In [647]:
df.loc[(df.index.value_counts() >1) ==True]

     A    B    C   E   F   G
5  NaN  NaN  NaN  E0  E1  E2
5  NaN  NaN  NaN  E0  E1  E2